# tuple : 함수와 함께 만이 사용되는 리스트와 비슷한 자료형으로, 리스트와 다른 점은 한번 결정된 요소는 바꿀 수 없다.
# 형태 : (데이터1, 데이터2, 데이터3, ....)

# 1. 인덱스를 통해 요소에 접근할 수 있다.

# 2. 요소를 하나만 가지는 튜플을 만들려면 ','가 필요하다
# - ex) (273, )

# 3. 괄호 없이 선언하고 할당이 가능하다. // 괄호 없이 여러 값을 할당하는 튜플로만 할 수 있다.
# - ex) a, b, c = 10, 20, 30

# 4. 튜플로 선언된 변수들의 값을 교환하는 것이 가능하다.
# - ex) a,b = 10,20
#       a,b = b,a   



# lambda : 함수라는 '기능'을 parameter로 전달하는 것을 더 효율적으로 하도록 하는 기능.
# 형태 : lambda 매개변수: 리턴값
# - ex) power = lambda x: x * x

# 매개변수로 함수를 전달하기 위해 함수 구문을 작성하는 것이 번거롭고, 코드낭비일 때 사용.

#@@@@ 람다를 사용하게 되면 예시를 추가해보자. 